# ~/.Brewfile
#
# List of packages to be installed / updated via Homebrew
# Apps are sorted by category, and arranged alphabetically
# Be sure to delete / comment out anything you do not need
# Usage, run: $ brew bundle --global --file $HOME/.Brewfile
# See brew docs for more info: https://docs.brew.sh/Manpage

# Options
cask_args appdir: '~/Applications', require_sha: true

# Taps
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

# CLI Essentials
brew 'git'
brew 'neovim'
brew 'ranger'
brew 'tmux'

# CLI Utils
brew 'ctags'
brew 'exa'
brew 'fzf'
brew 'glances'
brew 'gotop'
brew 'iproute2mac'
brew 'jq'
brew 'lazydocker'
brew 'scc'
brew 'tldr'
brew 'tree'
brew 'xsel'

# CLI Fun
brew 'figlet'
brew 'lolcat'
brew 'neofetch'

# Development
cask 'android-studio'
cask 'boop'
brew 'gradle'
cask 'iterm2'
cask 'postman'
cask 'sourcetree'
cask 'utm'
cask 'visual-studio-code'

# Development Utils
brew 'gh'
cask 'ngrok'

# Languages and Compilers
brew 'docker'
brew 'gcc'
brew 'go'
brew 'lua'
brew 'node'
brew 'nvm' 
brew 'openjdk'
brew 'python'
brew 'rust'

# Network and Security Testing
cask 'wireshark'
brew 'wrk'
cask 'owasp-zap'

# Security Utilities
brew 'bcrypt'
cask 'gpg-suite'
brew 'openssl'
cask 'veracrypt'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-fira-code'
cask 'font-hack'
cask 'font-inconsolata'

# Mac OS Mods and Imrovments
brew 'm-cli'
cask 'alt-tab'
cask 'amethyst'
cask 'anybar'
cask 'coteditor'
cask 'finicky'
cask 'hiddenbar'
cask 'linearmouse'
cask 'little-snitch'
cask 'stats'

# Productivity Utils
cask 'copyq'
tap 'espanso/espanso'
cask 'espanso'

# Media and Creativity
brew 'handbrake'
cask 'audacity'
cask 'gimp'
cask 'inkscape'
cask 'obs'
cask 'shotcut'
cask 'spotify', args: { require_sha: false }
cask 'transmission'
cask 'vlc'

# General Applications
cask '1password'
cask 'tresorit'
cask 'firefox'
cask 'chromium'
cask 'standard-notes'
